## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/8049178871)



<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main
  * module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool_provider.main
  * module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.service_account["terraform_executor_post_prod_apply"]
  * module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.service_account["terraform_executor_pull_prod_plan"]
* Update
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
        # (12 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main will be created
  + resource "google_iam_workload_identity_pool" "main" {
      + disabled                  = false
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "sap-kyma-prow"
      + state                     = (known after apply)
      + workload_identity_pool_id = "github-com-kyma-project"
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool_provider.main will be created
  + resource "google_iam_workload_identity_pool_provider" "main" {
      + attribute_mapping                  = {
          + "attribute.actor"               = "assertion.actor"
          + "attribute.aud"                 = "assertion.aud"
          + "attribute.event_name"          = "assertion.event_name"
          + "attribute.repository_id"       = "assertion.repository_id"
          + "attribute.repository_owner_id" = "assertion.repository_owner_id"
          + "attribute.workflow"            = "assertion.workflow"
          + "attribute.workflow_ref"        = "assertion.workflow_ref"
          + "google.subject"                = "\"repository_id:\" + assertion.repository_id + \":repository_owner_id:\" + assertion.repository_owner_id + \":workflow:\" + assertion.workflow"
        }
      + disabled                           = false
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "sap-kyma-prow"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-com-kyma-project"
      + workload_identity_pool_provider_id = "github-com-kyma-project"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.service_account["terraform_executor_post_prod_apply"] will be created
  + resource "google_service_account_iam_member" "service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.service_account["terraform_executor_pull_prod_plan"] will be created
  + resource "google_service_account_iam_member" "service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 4 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2024-02-26T12:52:30.572039Z" -> "2024-02-26T12:54:30.621360Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":9964,"Program":"tfcmt","SHA1":"3b377fba2eba0d695450618f0714c5b283967c43","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->